#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.management.azurerm_resource_group.resource_group_identity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-identity-rg][0m
[0m[1mmodule.management.azurerm_resource_group.resource_group_logging: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg][0m
[0m[1mmodule.connectivity.azurerm_resource_group.resource_group_private_dns: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg][0m
[0m[1mmodule.connectivity.azurerm_resource_group.resource_group_hub: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg][0m
[0m[1mmodule.connectivity.azurerm_resource_group.resource_group_network_manager: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-ntwrkmngr-rg][0m
[0m[1mmodule.management.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-identity-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ptt-dev-uai001][0m
[0m[1mmodule.management.azurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azure-devices-provisioning.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azure-devices-provisioning.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azconfig.io"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azconfig.io][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.directline.botframework.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.directline.botframework.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.table.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.openai.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.servicebus.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.adf.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.agentsvc.azure-automation.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.agentsvc.azure-automation.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.monitor.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.monitor.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.purview.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.attest.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.attest.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.ods.opinsights.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.ods.opinsights.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.wvd.microsoft.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.wvd.microsoft.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.pbidedicated.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.pbidedicated.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.cassandra.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cassandra.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.datafactory.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.mongo.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mongo.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azurewebsites.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.token.botframework.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.token.botframework.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.northeurope.kusto.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.northeurope.kusto.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.postgres.database.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.managedhsm.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.managedhsm.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.blob.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.sql.azuresynapse.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.tip1.powerquery.microsoft.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.tip1.powerquery.microsoft.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.postgres.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.dev.azuresynapse.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.documents.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.service.signalr.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.service.signalr.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.analytics.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.analytics.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azurehdinsight.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurehdinsight.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.database.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.database.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.queue.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azureiotcentral.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azureiotcentral.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.redis.cache.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.web.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.web.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.redisenterprise.cache.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redisenterprise.cache.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.his.arc.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.his.arc.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.analysis.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.analysis.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.file.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.table.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.dp.kubernetesconfiguration.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dp.kubernetesconfiguration.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.dfs.core.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["northeurope.service.privatelink.batch.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/northeurope.service.privatelink.batch.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azurestaticapps.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurestaticapps.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.purviewstudio.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.guestconfiguration.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.guestconfiguration.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.cognitiveservices.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azure-automation.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azure-automation.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.grafana.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.grafana.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.dicom.azurehealthcareapis.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dicom.azurehealthcareapis.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.siterecovery.windowsazure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.siterecovery.windowsazure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.eventgrid.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.eventgrid.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink-global.wvd.microsoft.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink-global.wvd.microsoft.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["northeurope.privatelink.batch.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/northeurope.privatelink.batch.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.mysql.database.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.fhir.azurehealthcareapis.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.fhir.azurehealthcareapis.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.northeurope.backup.windowsazure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.northeurope.backup.windowsazure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.oms.opinsights.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.oms.opinsights.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.api.azureml.ms"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.digitaltwins.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.digitaltwins.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azure-devices.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azure-devices.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azurecr.io"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azure-api.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.api.adu.microsoft.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.adu.microsoft.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["northeurope.data.privatelink.azurecr.io"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/northeurope.data.privatelink.azurecr.io][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.gremlin.cosmos.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.gremlin.cosmos.azure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.northeurope.azmk8s.io"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.northeurope.azmk8s.io][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.search.windows.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azuredatabricks.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.notebooks.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.media.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.media.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.afs.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.afs.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.prod.migration.windowsazure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.prod.migration.windowsazure.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.vaultcore.azure.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.workspace.azurehealthcareapis.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.workspace.azurehealthcareapis.com][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.azuresynapse.net"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net][0m
[0m[1mmodule.connectivity.azurerm_private_dns_zone.private_dns_zone["privatelink.mariadb.database.azure.com"]: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mariadb.database.azure.com][0m
[0m[1mazurerm_management_group.management_group_root: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech][0m
[0m[1mmodule.connectivity.azurerm_network_security_group.network_security_group_default: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.connectivity.azurerm_network_security_group.network_security_group_bastion: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-bastion-nsg001][0m
[0m[1mmodule.connectivity.azurerm_public_ip_prefix.public_ip_prefix: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/publicIPPrefixes/ptt-dev-ippre001][0m
[0m[1mmodule.connectivity.azurerm_virtual_network.virtual_network_hub: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.SecurityInsights"]: Refreshing state... [id=5092326737509319541][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.Security"]: Refreshing state... [id=878746821838827266][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.Insights"]: Refreshing state... [id=6313069297833920377][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.PolicyInsights"]: Refreshing state... [id=2301590291403248086][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.Network"]: Refreshing state... [id=1497235380947419827][0m
[0m[1mnull_resource.provider_registration_mg["Microsoft.Consumption"]: Refreshing state... [id=6321884621657824776][0m
[0m[1mmodule.management.azurerm_role_assignment.uai_role_assignment_: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/roleAssignments/99da4c3c-e6c2-f693-938c-968f13b79328][0m
[0m[1mmodule.connectivity.azurerm_network_manager.network_manager: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-ntwrkmngr-rg/providers/Microsoft.Network/networkManagers/ptt-dev-avnm][0m
[0m[1mtime_sleep.sleep_provider_registration_mg: Refreshing state... [id=2024-09-25T14:08:53Z][0m
[0m[1mazurerm_management_group.management_group_playground: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-playground][0m
[0m[1mazurerm_management_group.management_group_platform: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-platform][0m
[0m[1mazurerm_management_group.management_group_landing_zones: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-landing-zones][0m
[0m[1mazurerm_management_group.management_group_decomissioned: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-decomissioned][0m
[0m[1mazurerm_management_group.management_group_management: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-management][0m
[0m[1mazurerm_management_group.management_group_identity: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-identity][0m
[0m[1mazurerm_management_group.management_group_connectivity: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-connectivity][0m
[0m[1mmodule.connectivity.azurerm_public_ip.public_ip: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/publicIPAddresses/ptt-dev-pip001][0m
[0m[1mazurerm_management_group.management_group_corp: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-corp][0m
[0m[1mazurerm_management_group.management_group_cloud_native: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-cloud-native][0m
[0m[1mmodule.policies_root.azurerm_role_definition.role_definitions["PlatformContributor.json"]: Refreshing state... [id=/providers/Microsoft.Authorization/roleDefinitions/711273b4-3079-c819-9047-ea90c225153b|/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech][0m
[0m[1mmodule.policies_root.azurerm_role_definition.role_definitions["LandingZoneSubscriptionOwner.json"]: Refreshing state... [id=/providers/Microsoft.Authorization/roleDefinitions/547a4286-038c-08b2-1e30-7d1cdf3ebf1d|/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_bastion: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzureBastionSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_dns_inbound: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverInboundSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_services: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_firewall: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzureFirewallSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_jumpbox: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/JumpboxSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet.subnet_dns_outbound: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverOutboundSubnet][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["DenyAction-DiagnosticSettings-Platform.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/DenyAction-DiagnosticSettings-Platform][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-KeyVault-Vault.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-KeyVault-Vault][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-StorageQueue.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-StorageQueue][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-ResourceAccessRulesTenantId-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-ResourceAccessRulesTenantId-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-ContainerRegistry-Registry.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-ContainerRegistry-Registry][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-SynapseBigDataPool.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-SynapseBigDataPool][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-Function.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-Function][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-StorageBlob.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-StorageBlob][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-CORS-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-CORS-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-Firewallrules-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-Firewallrules-SynapseWorkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-VulnerabilityAssessments-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-VulnerabilityAssessments-SynapseWorkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Auditing-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Auditing-SynapseWorkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-NetworkAclsBypass-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-NetworkAclsBypass-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-NetworkAclsVirtualNetworkRules-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-NetworkAclsVirtualNetworkRules-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-StorageTable.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-StorageTable][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-Queue.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-Queue][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-ContainerDeleteRetentionPolicy-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-ContainerDeleteRetentionPolicy-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Search-SearchService.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Search-SearchService][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-AllowedCopyScope-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-AllowedCopyScope-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-KeyVault.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-KeyVault][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-MachineLearning-Amlworkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-MachineLearning-Amlworkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-IsLocalUserEnabled-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-IsLocalUserEnabled-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-CognitiveServices-Account.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-CognitiveServices-Account][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Kusto-Cluster.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Kusto-Cluster][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-Table.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-Table][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-SynapseSqlPool.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-SynapseSqlPool][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-ResourceAccessRulesResourceId-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-ResourceAccessRulesResourceId-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-SynapseKustoPool.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-SynapseKustoPool][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-SynapseWorkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-TransparentDataEncryption-SynapseSqlPool.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-TransparentDataEncryption-SynapseSqlPool][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-IsSftpEnabled-Storage.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-IsSftpEnabled-Storage][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-Blob.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-Blob][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-Dfs.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-Dfs][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-TrustedServiceBypassEnabled-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-TrustedServiceBypassEnabled-SynapseWorkspace][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-DiagnosticSettings-Platform.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-DiagnosticSettings-Platform][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-Logging-SynapseSpark.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-Logging-SynapseSpark][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-Diagnostics-StorageFile.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-Diagnostics-StorageFile][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Synapse-Dev.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Synapse-Dev][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Synapse-Sql.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Synapse-Sql][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-AppService-Sites.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-AppService-Sites][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-Web.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-Web][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Dine-DNSZoneGroup-Storage-File.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Dine-DNSZoneGroup-Storage-File][0m
[0m[1mmodule.policies_root.azurerm_policy_definition.policy_definitions["Deny-LinkedAccessCheckOnTargetResource-SynapseWorkspace.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policyDefinitions/Deny-LinkedAccessCheckOnTargetResource-SynapseWorkspace][0m
[0m[1mmodule.connectivity.azurerm_subnet_network_security_group_association.subnet_dns_inbound_network_security_group_association: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverInboundSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet_network_security_group_association.subnet_bastion_network_security_group_association: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzureBastionSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet_network_security_group_association.subnet_jumpbox_network_security_group_association: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/JumpboxSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet_network_security_group_association.subnet_services_network_security_group_association: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.connectivity.azurerm_subnet_network_security_group_association.subnet_dns_outbound_network_security_group_association: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverOutboundSubnet][0m
[0m[1mmodule.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-KeyVault.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-KeyVault][0m
[0m[1mmodule.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-PrvtDnsZnGrps.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-PrvtDnsZnGrps][0m
[0m[1mmodule.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-Diagnostics.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-Diagnostics][0m
[0m[1mmodule.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-Function.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-Function][0m
[0m[1mmodule.policies_landing_zones.azurerm_management_group_policy_assignment.policy_assignments["Cmplnt-Diagnostics.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-landing-zones/providers/Microsoft.Authorization/policyAssignments/Cmplnt-Diagnostics][0m
[0m[1mmodule.policies_landing_zones.azurerm_management_group_policy_assignment.policy_assignments["Cmplnt-PrvtDnsZnGrps.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-landing-zones/providers/Microsoft.Authorization/policyAssignments/Cmplnt-PrvtDnsZnGrps][0m
[0m[1mmodule.policies_landing_zones.azurerm_management_group_policy_assignment.policy_assignments["Cmplnt-Function.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-landing-zones/providers/Microsoft.Authorization/policyAssignments/Cmplnt-Function][0m
[0m[1mmodule.policies_landing_zones.azurerm_management_group_policy_assignment.policy_assignments["Cmplnt-KeyVault.json"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ptt-dev-landing-zones/providers/Microsoft.Authorization/policyAssignments/Cmplnt-KeyVault][0m
[0m[1mmodule.connectivity.azurerm_network_manager_network_group.network_manager_network_group_spokes: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-ntwrkmngr-rg/providers/Microsoft.Network/networkManagers/ptt-dev-avnm/networkGroups/ptt-dev-avnm-group-spokes][0m
[0m[1mmodule.connectivity.azurerm_network_manager_connectivity_configuration.network_manager_connectivity_configuration_spokes: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-ntwrkmngr-rg/providers/Microsoft.Network/networkManagers/ptt-dev-avnm/connectivityConfigurations/ptt-dev-avnm-connectivity-spokes][0m
[0m[1mmodule.connectivity.azurerm_network_manager_deployment.network_manager_mesh_deployment_connectivity: Refreshing state... [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-ntwrkmngr-rg/providers/Microsoft.Network/networkManagers/ptt-dev-avnm/commit|northeurope|Connectivity][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # azurerm_management_group.management_group_corp[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_management_group" "management_group_corp" {
        id                         = "/providers/Microsoft.Management/managementGroups/ptt-dev-corp"
        name                       = "ptt-dev-corp"
      [33m~[0m[0m subscription_ids           = [
          [32m+[0m[0m "1fdab118-1638-419a-8b12-06c9543714a0",
          [32m+[0m[0m "660ed196-9d05-44fc-b902-0c11ca014bd6",
          [32m+[0m[0m "9842be63-c8c0-4647-a5d1-0c5e7f8bbb25",
        ]
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.connectivity.azurerm_firewall.firewall[0m will be created
[0m  [32m+[0m[0m resource "azurerm_firewall" "firewall" {
      [32m+[0m[0m dns_proxy_enabled   = (known after apply)
      [32m+[0m[0m firewall_policy_id  = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "ptt-dev-fw001"
      [32m+[0m[0m resource_group_name = "ptt-dev-hub-northeurope-rg"
      [32m+[0m[0m sku_name            = "AZFW_VNet"
      [32m+[0m[0m sku_tier            = "Standard"
      [32m+[0m[0m threat_intel_mode   = (known after apply)
      [32m+[0m[0m zones               = [
          [32m+[0m[0m "1",
          [32m+[0m[0m "2",
          [32m+[0m[0m "3",
        ]

      [32m+[0m[0m ip_configuration {
          [32m+[0m[0m name                 = "public-ip"
          [32m+[0m[0m private_ip_address   = (known after apply)
          [32m+[0m[0m public_ip_address_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/publicIPAddresses/ptt-dev-pip001"
          [32m+[0m[0m subnet_id            = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzureFirewallSubnet"
        }
    }

[1m  # module.connectivity.azurerm_firewall_policy.firewall_policy[0m will be created
[0m  [32m+[0m[0m resource "azurerm_firewall_policy" "firewall_policy" {
      [32m+[0m[0m auto_learn_private_ranges_enabled = true
      [32m+[0m[0m child_policies                    = (known after apply)
      [32m+[0m[0m firewalls                         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m location                          = "northeurope"
      [32m+[0m[0m name                              = "ptt-dev-fw001"
      [32m+[0m[0m resource_group_name               = "ptt-dev-hub-northeurope-rg"
      [32m+[0m[0m rule_collection_groups            = (known after apply)
      [32m+[0m[0m sku                               = "Standard"
      [32m+[0m[0m sql_redirect_allowed              = false
      [32m+[0m[0m threat_intelligence_mode          = "Alert"

      [32m+[0m[0m dns {
          [32m+[0m[0m proxy_enabled = true
          [32m+[0m[0m servers       = []
        }

      [32m+[0m[0m insights {
          [32m+[0m[0m default_log_analytics_workspace_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
          [32m+[0m[0m enabled                            = true
          [32m+[0m[0m retention_in_days                  = 30
        }

      [32m+[0m[0m threat_intelligence_allowlist {}
    }

[1m  # module.connectivity.azurerm_route_table.route_table_default[0m will be created
[0m  [32m+[0m[0m resource "azurerm_route_table" "route_table_default" {
      [32m+[0m[0m bgp_route_propagation_enabled = true
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "ptt-dev-default-rt001"
      [32m+[0m[0m resource_group_name           = "ptt-dev-hub-northeurope-rg"
      [32m+[0m[0m route                         = [
          [32m+[0m[0m {
              [32m+[0m[0m address_prefix         = "0.0.0.0/0"
              [32m+[0m[0m name                   = "default-firewall"
              [32m+[0m[0m next_hop_in_ip_address = (known after apply)
              [32m+[0m[0m next_hop_type          = "VirtualAppliance"
            },
        ]
      [32m+[0m[0m subnets                       = (known after apply)
    }

[1m  # module.connectivity.azurerm_subnet_route_table_association.subnet_bastion_route_table_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "subnet_bastion_route_table_association" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzureBastionSubnet"
    }

[1m  # module.connectivity.azurerm_subnet_route_table_association.subnet_dns_inbound_route_table_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "subnet_dns_inbound_route_table_association" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverInboundSubnet"
    }

[1m  # module.connectivity.azurerm_subnet_route_table_association.subnet_dns_outbound_route_table_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "subnet_dns_outbound_route_table_association" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/AzurePrivateDnsResolverOutboundSubnet"
    }

[1m  # module.connectivity.azurerm_subnet_route_table_association.subnet_jumpbox_route_table_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "subnet_jumpbox_route_table_association" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/JumpboxSubnet"
    }

[1m  # module.connectivity.azurerm_subnet_route_table_association.subnet_services_route_table_association[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet_route_table_association" "subnet_services_route_table_association" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-hub-northeurope-rg/providers/Microsoft.Network/virtualNetworks/ptt-dev-vnet001/subnets/ServicesSubnet"
    }

[1m  # module.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-Function.json"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_policy_set_definition" "policy_set_definitions" {
        id                  = "/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-Function"
        name                = "Cmplnt-Function"
      [32m+[0m[0m parameters          = jsonencode({})
        [90m# (5 unchanged attributes hidden)[0m[0m

        [90m# (30 unchanged blocks hidden)[0m[0m
    }

[1m  # module.policies_root.azurerm_policy_set_definition.policy_set_definitions["Cmplnt-KeyVault.json"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_policy_set_definition" "policy_set_definitions" {
        id                  = "/providers/Microsoft.Management/managementGroups/ptt-dev-perfectthymetech/providers/Microsoft.Authorization/policySetDefinitions/Cmplnt-KeyVault"
        name                = "Cmplnt-KeyVault"
      [32m+[0m[0m parameters          = jsonencode({})
        [90m# (5 unchanged attributes hidden)[0m[0m

        [90m# (10 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 8 to add, 3 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>